/*
- Користувач вводить або має два числа.
    Потрібно знайти та вивести максимальне число з тих двох .
    Також потрібно врахувати коли введені рівні числа.
*/


/*let a = +prompt('Введіть перше число');
let b = +prompt('Введіть друге число');

if (a < b){
    console.log(b);
}else if ( a > b){
    console.log(a);
} else if ( a === b){
    console.log('Числа рівні')
}*/


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.


/*

 let entrance = +prompt('Введіть потрібний номер квартири');
 if ( entrance > 0 && entrance <= 20){
     console.log('Це перший під\їзд');
 }
 else if (entrance > 20 && entrance <= 48){
     console.log('Це другий під\їзд');
 }
 else if (entrance > 48 && entrance <= 90){
     console.log('Це третій під\їзд')
 }
 else {
     console.log('Ви зазначили не існуючий номер квартири')
}
*/


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО


/*
let number = +prompt('Введіть число')
if (number === 10){
    console.log('ВІРНО');
}else{
    console.log('НЕВІРНО');
}*/


/*
- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
    якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
якщо в змінну записали щось інше, спрацьовує else
*/


/*
let xxx =
if (typeof xxx === 'number'){
    document.write('1');
}
else if (typeof xxx === 'string'){
    document.write('2');
}
else if (typeof xxx === 'boolean')
    document.write('3');
else if (typeof xxx === 'object'){
    document.write('4')
}
else{
    document.write('Please try again')
}

*/

/*
- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН*/

/*let OktenTemp = Math.round(Math.random()*40);


if (OktenTemp >= 10 && OktenTemp <= 22){
    document.write('Ми йдемо вчитися!')
}
else{
    document.write('Сидимо вдома і вчимося онлайн!')

}*/


/*- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .*/


/*gift = +prompt('Введіть число від одного до п\'яти')
switch (gift){
    case 1:
        document.write('Ви отримали Авто!');
        break;
    case 2:
        document.write('Ви отримали Мото!');
        break;
    case 3:
        document.write('Ви отримали Телефон!');
        break;
    case 4:
        document.write('Ви отримали Ноутбук!');
        break;
    case 5:
        document.write('Ви отримали Телевізор!');
        break;
    default:
        document.write('Це число не вірне!');

}*/
